; domain
(define (domain blocksworld)
    (:requirements :typing)
    (:types block robot)
    (:predicates 
        (on ?x - block ?y - block) ; observed predicate
        (ontable ?x - block)  ; derived predicate
        (clear ?x - block)  ; derived predicate
        (handempty ?x - robot)  ; derived predicate
        (handfull ?x - robot)  ; derived predicate
        (holding ?x - block) ; derived predicate
    )
    (:action pick_up
        :parameters (?x - block ?robot - robot)
        :precondition (and
            (clear ?x) 
            (ontable ?x) 
            (handempty ?robot)
        )
        :effect (and
            (not (ontable ?x))
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (holding ?x)
        )
    )
    (:action put_down
        :parameters (?x - block ?robot - robot)
        :precondition (and 
            (holding ?x)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (ontable ?x))
        )
    (:action stack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (holding ?x) 
            (clear ?y)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (on ?x ?y)
        )
    )
    (:action unstack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (on ?x ?y)
            (clear ?x)
            (handempty ?robot)
        )
        :effect (and 
            (holding ?x)
            (clear ?y)
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (not (on ?x ?y))
        )
    )
)

; problem
(define (problem blocksworld2)
(:domain blocksworld)
(:objects
    blue_block - block 
    arm - robot 
    purple_block - block 
    pink_block - block 
    red_block - block 
)

(:init
    ( clear blue_block )
    ( clear pink_block )
    ( clear purple_block )
    ( clear red_block )
    ( handempty arm )
    ( ontable blue_block )
    ( ontable pink_block )
    ( ontable purple_block )
    ( ontable red_block )
)

    (:goal (and (on red_block blue_block) (on blue_block purple_block) (on purple_block pink_block)))
)

; plan
1. (pick_up red_block arm)
   deleted: (ontable red_block) (clear red_block) (handempty arm)
   added: (handfull arm) (holding red_block)
   goals met: 0 of 3
2. (stack red_block blue_block arm)
   deleted: (holding red_block) (clear blue_block) (handfull arm)
   added: (clear red_block) (handempty arm) (on red_block blue_block)
   goals met: 1 of 3
3. (pick_up purple_block arm)
   deleted: (ontable purple_block) (clear purple_block) (handempty arm)
   added: (handfull arm) (holding purple_block)
   goals met: 1 of 3
4. (stack purple_block pink_block arm)
   deleted: (holding purple_block) (clear pink_block) (handfull arm)
   added: (clear purple_block) (handempty arm) (on purple_block pink_block)
   goals met: 2 of 3
5. (unstack red_block blue_block arm)
   deleted: (clear red_block) (handempty arm) (on red_block blue_block)
   added: (holding red_block) (clear blue_block) (handfull arm)
   goals met: 1 of 3
6. (put_down red_block arm)
   deleted: (holding red_block) (handfull arm)
   added: (clear red_block) (handempty arm) (ontable red_block)
   goals met: 1 of 3
7. (pick_up blue_block arm)
   deleted: (ontable blue_block) (clear blue_block) (handempty arm)
   added: (handfull arm) (holding blue_block)
   goals met: 1 of 3
8. (stack blue_block purple_block arm)
   deleted: (holding blue_block) (clear purple_block) (handfull arm)
   added: (clear blue_block) (handempty arm) (on blue_block purple_block)
   goals met: 2 of 3
9. (pick_up red_block arm)
   deleted: (ontable red_block) (clear red_block) (handempty arm)
   added: (handfull arm) (holding red_block)
   goals met: 2 of 3
10. (stack red_block blue_block arm)
   deleted: (holding red_block) (clear blue_block) (handfull arm)
   added: (clear red_block) (handempty arm) (on red_block blue_block)
   goals met: 3 of 3
